# 1. 산술 연산

In [1]:
import pandas as pd
from pandas import Series, DataFrame

## 1) Series 산술연산
### - 같은 인덱스 라벨을 가진 항목끼리 산술 연산을 수행함.
### - 겹치는 인덱스가 없다면, 데이터는 NA가 된다.

In [2]:
s1 = Series ([3,5,-1, 5.7], index = ['a','c','d','b'])
s1

a    3.0
c    5.0
d   -1.0
b    5.7
dtype: float64

In [3]:
#실습 1. 아래와 같이  s2 Series 생성하기
s2 = Series([5.3, -3, 10, 5, -2], index = ['a','d','b','c','e'])
s2

a     5.3
d    -3.0
b    10.0
c     5.0
e    -2.0
dtype: float64

In [4]:
#같은 인덱스 라벨을 가진 항목끼리 산술 연산을 수행함.
#겹치는 인덱스가 없다면, 데이터는 NA가 된다. 
s1+s2

a     8.3
b    15.7
c    10.0
d    -4.0
e     NaN
dtype: float64

In [5]:
s1.add(s2, fill_value = 0)
#산술 연산 시, 데이터가 없는 경우 fill_value인자의 값으로 간주함.

a     8.3
b    15.7
c    10.0
d    -4.0
e    -2.0
dtype: float64

## 2) DataFrame 산술연산

In [6]:
#실습 2. 아래와 같이 df1 DataFrame 생성
arr1 = [[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]]
df1 = DataFrame(arr1, columns = list('bcd'), index = ['Ohio', 'Texas', 'Colorado'])
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [7]:
#실습 3. 아래와 같이 df2 DataFrame 생성
arr2 = [[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11]]
df2 = DataFrame(arr2, columns = list('bde'), index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [8]:
# DataFrame의 경우, 컬럼과 인덱스 이름 모두 동일한 경우에만 산술 연산이 수행됨.
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [9]:
df1.add(df2)
#df1 + df2와 동일하지만, 함수로 사용하는 경우에는 다양한 파라미터 설정이 가능해짐.

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [10]:
df1.add(df2, fill_value = 0)
#fill_value = <값> : Missing Value를 <값>으로 간주함. 두 데이터프레임에 모두 없는 경우에는 결과도 Missing
# http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.add.html#pandas.DataFrame.add

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

## DataFrame 산술 연산
<img src="img/분석3/데이터프레임add.jpg" alt="Add" style="width: 1000px;"/>

### 산술연산 함수
<img src="img/분석3/산술연산.jpg" alt="산술연산" style="width: 200px;"/>

## 3) DataFrame과 Series 간의 연산

### DataFrame과 Series 간의 산술연산은 Series의 색인을 DataFrame의 칼럼에 맞추고 아래로 전파한다.

In [11]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [12]:
df3 = df1.loc['Ohio']
#df3.index = list('cde')
df3

b    0
c    1
d    2
Name: Ohio, dtype: int64

In [13]:
df1+ df3
#df1.add(df3)와 동일. axis = 1이 기본값.

          b  c   d
Ohio      0  2   4
Texas     3  5   7
Colorado  6  8  10

In [14]:
df3.index = ['Ohio', 'Texas','Colorado']
df3

Ohio        0
Texas       1
Colorado    2
Name: Ohio, dtype: int64

In [15]:
df1.add(df3, axis = 0)

          b  c   d
Ohio      0  1   2
Texas     4  5   6
Colorado  8  9  10

## 4) 함수 적용과 매핑

### apply() :각 로우나 컬럼의 1차원 배열에 함수를 적용
### applymap() : 각 항목에 함수를 적용

#### 4-1) apply() 함수

In [16]:
def diff (x):
    return x.max() - x.min()

In [17]:
diff(s1)

6.7000000000000002

In [18]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [19]:
df1.apply(diff)
# apply() 함수 
# 인자로 함수이름을 전달하면, 각각의 컬럼에 함수를 적용함. (axis = 0 or 'index')
#diff(df1)으로 수행해도 동일함.

b    6
c    6
d    6
dtype: int64

In [20]:
df1.apply(diff, axis = 1)
#axis를 1 혹은 'column'으로 설정하면, 각각의 로우에 함수를 적용함.

Ohio        2
Texas       2
Colorado    2
dtype: int64

#### 4-2) applymap() 함수

In [21]:
def mul2(x):
    return x * 2

In [22]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [23]:
df1.applymap(mul2)

           b   c   d
Ohio       0   2   4
Texas      6   8  10
Colorado  12  14  16

In [24]:
mul2(df1)
# df1.applymap(mul2)와 동일함. 
# 수행되는 함수의 구현 방식에 따라 파이썬에서 자동으로 apply() 혹은 applymap() 함수로 자동으로 변환해서 수행함.

           b   c   d
Ohio       0   2   4
Texas      6   8  10
Colorado  12  14  16

In [25]:
df1.applymap(lambda x: x*2)

#익명 함수.
# lambda 라는 키워드로 익명 함수 정의
# 주로 비교적 간단한 기능의 함수가 컨테이너의 요소로 들어가는 경우 혹은 다른 함수의 인자로 함수를 넘겨줄 필요가 있을 때 사용

# lambda <인자>: <리턴값>

           b   c   d
Ohio       0   2   4
Texas      6   8  10
Colorado  12  14  16

# 2. 정렬

In [27]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [28]:
# sort_index() : 인덱스 라벨로 정렬하기
df2.sort_index()

        b   d   e
Ohio    3   4   5
Oregon  9  10  11
Texas   6   7   8
Utah    0   1   2

In [29]:
df2.sort_index(ascending= False)

        b   d   e
Utah    0   1   2
Texas   6   7   8
Oregon  9  10  11
Ohio    3   4   5

In [30]:
# sort_values() : 데이터 정렬하기

<img src="img/분석3/데이터프레임정렬.jpg" alt="DataFrame.sort_values" style="width: 600px;"/>

### http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.sort_values.html#pandas.DataFrame.sort_values

In [33]:
df2.sort_values(by = 'b') 
#'b'컬럼의 값을 기준으로 내림차순으로 row들을 정렬함.

        b   d   e
Oregon  9  10  11
Texas   6   7   8
Ohio    3   4   5
Utah    0   1   2

In [35]:
df2.sort_values(by='Utah', axis = 1)
# 인덱스 라벨이 'Utah' 인 row의 컬럼들을 내림차순으로 정렬함.

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [37]:
df2.sort_values(by='Utah', axis = 1, ascending = False, inplace = True)
# inplace의 기본값은 false로써 데이터 자체를 변경하지는 않고, 정렬된 결과만 보여줌. 
# inplace 인자를 True로 하면, 데이터 자체를 정렬된 결과로 변경함.

In [38]:
df2

         e   d  b
Utah     2   1  0
Ohio     5   4  3
Texas    8   7  6
Oregon  11  10  9

# 3. 통계 함수
## 3-1) 주요 통계 함수 목록
<img src="img/분석3/통계함수.jpg" alt="통계함수" style="width: 400px;"/>

## 3-2) 주요 함수 옵션
<img src="img/분석3/주요함수옵션.jpg" alt="주요옵션" style="width: 400px;"/>

### ** axis는 통계함수 뿐만 아니라, 많은 함수에서 동일하게 적용됨. **

In [39]:
iris = pd.read_csv('data/iris.data', header = None, names = ['꽃받침너비', '꽃받침길이', '꽃잎너비', '꽃잎길이', '종'])

In [40]:
iris.head(5)

   꽃받침너비  꽃받침길이  꽃잎너비  꽃잎길이            종
0    5.1    3.5   1.4   0.2  Iris-setosa
1    4.9    3.0   1.4   0.2  Iris-setosa
2    4.7    3.2   1.3   0.2  Iris-setosa
3    4.6    3.1   1.5   0.2  Iris-setosa
4    5.0    3.6   1.4   0.2  Iris-setosa

In [41]:
iris.count()

꽃받침너비    150
꽃받침길이    150
꽃잎너비     150
꽃잎길이     150
종        150
dtype: int64

In [42]:
iris.count(axis = 1)

0      5
1      5
2      5
3      5
4      5
5      5
6      5
7      5
8      5
9      5
10     5
11     5
12     5
13     5
14     5
15     5
16     5
17     5
18     5
19     5
20     5
21     5
22     5
23     5
24     5
25     5
26     5
27     5
28     5
29     5
      ..
120    5
121    5
122    5
123    5
124    5
125    5
126    5
127    5
128    5
129    5
130    5
131    5
132    5
133    5
134    5
135    5
136    5
137    5
138    5
139    5
140    5
141    5
142    5
143    5
144    5
145    5
146    5
147    5
148    5
149    5
Length: 150, dtype: int64

In [43]:
iris.describe()

            꽃받침너비       꽃받침길이        꽃잎너비        꽃잎길이
count  150.000000  150.000000  150.000000  150.000000
mean     5.843333    3.054000    3.758667    1.198667
std      0.828066    0.433594    1.764420    0.763161
min      4.300000    2.000000    1.000000    0.100000
25%      5.100000    2.800000    1.600000    0.300000
50%      5.800000    3.000000    4.350000    1.300000
75%      6.400000    3.300000    5.100000    1.800000
max      7.900000    4.400000    6.900000    2.500000

In [44]:
iris.sum()

꽃받침너비                                                876.5
꽃받침길이                                                458.1
꽃잎너비                                                 563.8
꽃잎길이                                                 179.8
종        Iris-setosaIris-setosaIris-setosaIris-setosaIr...
dtype: object

In [46]:
iris.sum(axis = 1)

0      10.2
1       9.5
2       9.4
3       9.4
4      10.2
5      11.4
6       9.7
7      10.1
8       8.9
9       9.6
10     10.8
11     10.0
12      9.3
13      8.5
14     11.2
15     12.0
16     11.0
17     10.3
18     11.5
19     10.7
20     10.7
21     10.7
22      9.4
23     10.6
24     10.3
25      9.8
26     10.4
27     10.4
28     10.2
29      9.7
       ...
120    18.1
121    15.3
122    19.2
123    15.7
124    17.8
125    18.2
126    15.6
127    15.8
128    16.9
129    17.6
130    18.2
131    20.1
132    17.0
133    15.7
134    15.7
135    19.1
136    17.7
137    16.8
138    15.6
139    17.5
140    17.8
141    17.4
142    15.5
143    18.2
144    18.2
145    17.2
146    15.7
147    16.7
148    17.3
149    15.8
Length: 150, dtype: float64

In [47]:
iris.var()

꽃받침너비    0.685694
꽃받침길이    0.188004
꽃잎너비     3.113179
꽃잎길이     0.582414
dtype: float64

# 4. 데이터 합치기
## 4-1) pandas.merge() 
     - 키를 기준으로 DataFrame의 로우를 합친다. SQL이나 다른 관계형 데이터베이스의 join 연산과 동일함.
     - 주요 파라미터        
        . left, right : merge할 DataFrame 객체이름
        . how = 'inner', #left, right, outer
        . on = None, #merge의 기준이 되는 컬럼
        . left_on = None, #left DataFrame의 기준 컬럼
        . right_on = None, #right DataFrame의 기준 컬럼

In [48]:
df_left = DataFrame({'KEY': ['k0', 'k1', 'k2', 'k3'],
                     'A': ['a0', 'a1', 'a2', 'a3'],
                     'B': ['b0', 'b1', 'b2', 'b3']})

In [49]:
df_right = DataFrame({'KEY': ['k2', 'k3', 'k4', 'k5'],
                     'C': ['c2', 'c3', 'c4', 'c5'],
                     'D': ['d2', 'd3', 'd4', 'd5']})

In [50]:
df_left

    A   B KEY
0  a0  b0  k0
1  a1  b1  k1
2  a2  b2  k2
3  a3  b3  k3

In [51]:
df_right

    C   D KEY
0  c2  d2  k2
1  c3  d3  k3
2  c4  d4  k4
3  c5  d5  k5

In [52]:
pd.merge(df_left, df_right)

    A   B KEY   C   D
0  a2  b2  k2  c2  d2
1  a3  b3  k3  c3  d3

In [53]:
pd.merge(df_left, df_right, how = 'left')

    A   B KEY    C    D
0  a0  b0  k0  NaN  NaN
1  a1  b1  k1  NaN  NaN
2  a2  b2  k2   c2   d2
3  a3  b3  k3   c3   d3

In [54]:
pd.merge(df_left, df_right, how = 'right')

     A    B KEY   C   D
0   a2   b2  k2  c2  d2
1   a3   b3  k3  c3  d3
2  NaN  NaN  k4  c4  d4
3  NaN  NaN  k5  c5  d5

In [55]:
pd.merge(df_left, df_right, how = 'outer')

     A    B KEY    C    D
0   a0   b0  k0  NaN  NaN
1   a1   b1  k1  NaN  NaN
2   a2   b2  k2   c2   d2
3   a3   b3  k3   c3   d3
4  NaN  NaN  k4   c4   d4
5  NaN  NaN  k5   c5   d5

In [57]:
# 실습 아래 2개의 DataFrame을 K1과 K2 컬럼으로 outer merge
df_left2 = DataFrame({'K1': ['k0', 'k1', 'k2', 'k3'],
                     'A': ['a0', 'a1', 'a2', 'a3'],
                     'B': ['b0', 'b1', 'b2', 'b3']})
df_right2 = DataFrame({'K2': ['k2', 'k3', 'k4', 'k5'],
                     'C': ['c2', 'c3', 'c4', 'c5'],
                     'D': ['d2', 'd3', 'd4', 'd5']})

In [58]:
pd.merge(df_left2, df_right2, left_on = 'K1', right_on = 'K2', how = 'outer')

     A    B   K1    C    D   K2
0   a0   b0   k0  NaN  NaN  NaN
1   a1   b1   k1  NaN  NaN  NaN
2   a2   b2   k2   c2   d2   k2
3   a3   b3   k3   c3   d3   k3
4  NaN  NaN  NaN   c4   d4   k4
5  NaN  NaN  NaN   c5   d5   k5